JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_edma_soc.h
/*
 * Copyright 2022 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#ifndef _FSL_EDMA_SOC_H_
#define _FSL_EDMA_SOC_H_

#include "fsl_common.h"

/*!
 * @addtogroup edma_soc
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/
/*! @name Driver version */
/*@{*/
/*! @brief Driver version 2.0.0. */
#define FSL_EDMA_SOC_DRIVER_VERSION (MAKE_VERSION(2, 0, 0))
/*@}*/

/*!@brief DMA IP version */
#define FSL_EDMA_SOC_IP_DMA3 (1)
#define FSL_EDMA_SOC_IP_DMA4 (1)

/*!@brief DMA base table */
#define EDMA_BASE_PTRS \
    {                  \
        DMA3, DMA4     \
    }

#define EDMA_CHN_IRQS                                                                                             \
    {                                                                                                             \
        {DMA3_CH0_IRQn,                                                                                           \
         DMA3_CH1_IRQn,                                                                                           \
         DMA3_CH2_IRQn,                                                                                           \
         DMA3_CH3_IRQn,                                                                                           \
         DMA3_CH4_IRQn,                                                                                           \
         DMA3_CH5_IRQn,                                                                                           \
         DMA3_CH6_IRQn,                                                                                           \
         DMA3_CH7_IRQn,                                                                                           \
         DMA3_CH8_IRQn,                                                                                           \
         DMA3_CH9_IRQn,                                                                                           \
         DMA3_CH10_IRQn,                                                                                          \
         DMA3_CH11_IRQn,                                                                                          \
         DMA3_CH12_IRQn,                                                                                          \
         DMA3_CH13_IRQn,                                                                                          \
         DMA3_CH14_IRQn,                                                                                          \
         DMA3_CH15_IRQn,                                                                                          \
         DMA3_CH16_IRQn,                                                                                          \
         DMA3_CH17_IRQn,                                                                                          \
         DMA3_CH18_IRQn,                                                                                          \
         DMA3_CH19_IRQn,                                                                                          \
         DMA3_CH20_IRQn,                                                                                          \
         DMA3_CH21_IRQn,                                                                                          \
         DMA3_CH22_IRQn,                                                                                          \
         DMA3_CH23_IRQn,                                                                                          \
         DMA3_CH24_IRQn,                                                                                          \
         DMA3_CH25_IRQn,                                                                                          \
         DMA3_CH26_IRQn,                                                                                          \
         DMA3_CH27_IRQn,                                                                                          \
         DMA3_CH28_SINC3_CH0_IRQn,                                                                                \
         DMA3_CH29_SINC3_CH1_IRQn,                                                                                \
         DMA3_CH30_SINC3_CH2_IRQn,                                                                                \
         DMA3_CH31_SINC3_CH3_IRQn},                                                                               \
        {                                                                                                         \
            DMA4_CH0_CH1_IRQn, DMA4_CH0_CH1_IRQn, DMA4_CH2_CH3_IRQn, DMA4_CH2_CH3_IRQn, DMA4_CH4_CH5_IRQn,        \
                DMA4_CH4_CH5_IRQn, DMA4_CH6_CH7_IRQn, DMA4_CH6_CH7_IRQn, DMA4_CH8_CH9_IRQn, DMA4_CH8_CH9_IRQn,    \
                DMA4_CH10_CH11_IRQn, DMA4_CH10_CH11_IRQn, DMA4_CH12_CH13_IRQn, DMA4_CH12_CH13_IRQn,               \
                DMA4_CH14_CH15_IRQn, DMA4_CH14_CH15_IRQn, DMA4_CH16_CH17_IRQn, DMA4_CH16_CH17_IRQn,               \
                DMA4_CH18_CH19_IRQn, DMA4_CH18_CH19_IRQn, DMA4_CH20_CH21_IRQn, DMA4_CH20_CH21_IRQn,               \
                DMA4_CH22_CH23_IRQn, DMA4_CH22_CH23_IRQn, DMA4_CH24_CH25_IRQn, DMA4_CH24_CH25_IRQn,               \
                DMA4_CH26_CH27_IRQn, DMA4_CH26_CH27_IRQn, DMA4_CH28_CH29_IRQn, DMA4_CH28_CH29_IRQn,               \
                DMA4_CH30_CH31_IRQn, DMA4_CH30_CH31_IRQn, DMA4_CH32_CH33_IRQn, DMA4_CH34_CH35_IRQn,               \
                DMA4_CH36_CH37_IRQn, DMA4_CH38_CH39_IRQn, DMA4_CH40_CH41_IRQn, DMA4_CH42_CH43_IRQn,               \
                DMA4_CH44_CH45_IRQn, DMA4_CH46_CH47_IRQn, DMA4_CH48_CH49_LPI2C5_IRQn, DMA4_CH50_CH51_LPI2C6_IRQn, \
                DMA4_CH52_CH53_SAI4_IRQn, DMA4_CH54_CH55_SPDIF_IRQn, DMA4_CH56_CH57_LPUART9_IRQn,                 \
                DMA4_CH58_CH59_LPUART10_IRQn, DMA4_CH60_CH61_LPUART11_IRQn, DMA4_CH62_CH63_LPUART12_IRQn          \
        }                                                                                                         \
    }

