JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_edma_soc.h
    kDma4RequestMuxSINC2Request0                   = 212 | 0x200U, /**< SINC2 Reqest 0 */
    kDma4RequestMuxSINC2Request1                   = 213 | 0x200U, /**< SINC2 Reqest 1 */
    kDma4RequestMuxSINC2Request2                   = 214 | 0x200U, /**< SINC2 Reqest 2 */
    kDma4RequestMuxSINC2Request3                   = 215 | 0x200U, /**< SINC2 Reqest 3 */
    kDma4RequestMuxSINC3Request0                   = 216 | 0x200U, /**< SINC3 Reqest 0 */
    kDma4RequestMuxSINC3Request1                   = 217 | 0x200U, /**< SINC3 Reqest 1 */
    kDma4RequestMuxSINC3Request2                   = 218 | 0x200U, /**< SINC3 Reqest 2 */
    kDma4RequestMuxSINC3Request3                   = 219 | 0x200U, /**< SINC3 Reqest 3 */
    kDma4RequestMuxADC1Request1                    = 220 | 0x200U, /**< ADC1 Reqest 1 */
    kDma4RequestMuxADC2Request1                    = 221 | 0x200U, /**< ADC2 Reqest 1 */
} dma_request_source_t;

/*!< Verify dma base and request source */
#define EDMA_CHANNEL_HAS_REQUEST_SOURCE(base, source) ((base) == DMA3 ? ((source)&0x100U) : ((source)&0x200U))

#define FSL_FEATURE_EDMA_MODULE_CHANNEL(base)                    (base == DMA3 ? 32U : 64U)
#define FSL_FEATURE_EDMA_MODULE_MAX_CHANNEL                      (64)
#define FSL_FEATURE_EDMA_HAS_GLOBAL_MASTER_ID_REPLICATION        (1)
#define FSL_FEATURE_EDMA_HAS_CONTINUOUS_LINK_MODE                (0)
#define FSL_FEATURE_EDMA_MODULE_COUNT                            (2)
#define FSL_FEATURE_EDMA_HAS_CHANNEL_CONFIG                      (1)
#define FSL_FEATURE_EDMA_HAS_CHANNEL_SWAP_SIZE                   (1)
#define FSL_FEATURE_EDMA_HAS_CHANNEL_ACCESS_TYPE                 (1)
#define FSL_FEATURE_EDMA_HAS_CHANNEL_MEMRORY_ATTRIBUTE           (1)
#define FSL_FEATURE_EDMA_HAS_CHANNEL_SIGN_EXTENSION              (1)
#define FSL_FEATURE_EDMA_MODULE_SUPPORT_MATTR(base)              (base == DMA3 ? 0U : 1U)
#define FSL_FEATURE_EDMA_MODULE_SUPPORT_SIGN_EXTENSION(base)     (base == DMA3 ? 0U : 1U)
#define FSL_FEATURE_EDMA_MODULE_SUPPORT_SWAP(base)               (base == DMA3 ? 0U : 1U)
#define FSL_FEATURE_EDMA_MODULE_SUPPORT_INSTR(base)              (base == DMA3 ? 0U : 1U)
#define FSL_FEATURE_EDMA_SUPPORT_128_BYTES_TRANSFER              (1)
#define FSL_FEATURE_EDMA_MODULE_SUPPORT_128_BYTES_TRANSFER(base) (base == DMA3 ? 0U : 1U)

/*!@brief EDMA base address convert macro */
#define EDMA_CHANNEL_OFFSET           0x10000U
#define EDMA_CHANNEL_ARRAY_STEP(base) ((base) == DMA3 ? 0x10000U : 0x8000U)

/*******************************************************************************
 * API
 ******************************************************************************/

#ifdef __cplusplus
extern "C" {
#endif

#ifdef __cplusplus
}
#endif

/*!
 * @}
 */

#endif /* _FSL_EDMA_SOC_H_ */
